Revit 2024 API
AngularDimension Class
 An object that represents an Angular Dimension within the Revit project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class AngularDimension : Dimension
Visual Basic
Public Class AngularDimension _
	Inherits Dimension
Visual C++
public ref class AngularDimension : public Dimension
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Dimension
 Autodesk.Revit.DB.AngularDimension
See Also
AngularDimension Members
Autodesk.Revit.DB Namespace